In [2]:
import numpy as np
import pandas as pd

In [7]:
labels = ['q','w','e']
my_list = [500,600,700]
arr = np.array([700,800,900])
x = {'q':500,'w':600,'e':700}

In [3]:
pd.Series(data=my_list)

0    500
1    600
2    700
dtype: int64

In [9]:
pd.Series(data=my_list,index=labels)

q    500
w    600
e    700
dtype: int64

In [8]:
pd.Series(arr)

0    700
1    800
2    900
dtype: int32

In [10]:
pd.Series(x)

q    500
w    600
e    700
dtype: int64

In [22]:
a = [i for i in range (70,74)]
b = [i for i in range (74,78)]
c = [i for i in range (78,82)]

In [23]:
pd.DataFrame(data=[a,b,c],
index = 'a b c'.split(),
columns = 'w x y z'.split())

    w   x   y   z
a  70  71  72  73
b  74  75  76  77
c  78  79  80  81

In [25]:
pd.DataFrame(data=list(zip(a,b,c)),
index = 'w x y z'.split(),
columns = 'a b c'.split())

    a   b   c
w  70  74  78
x  71  75  79
y  72  76  80
z  73  77  81

In [26]:
from numpy.random import randn
np.random.seed(101)

In [30]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E'.split())

In [31]:
df

          0         1         2         3
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [32]:
my_d = {'a':[1,2,3,4],
'b':[5,6,7,8],
'c':[9,10,11,12]}
pd.DataFrame(my_d,
index = 'w x y z'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [33]:
df.loc['new']=[1,2,3,4]
df

            0         1         2         3
A    0.386030  2.084019 -0.376519  0.230336
B    0.681209  1.035125 -0.031160  1.939932
C   -1.005187 -0.741790  0.187125 -0.732845
D   -1.382920  1.482495  0.961458 -2.141212
E    0.992573  1.192241 -1.046780  1.292765
new  1.000000  2.000000  3.000000  4.000000

In [35]:
df['new'] = df[0] + df[2]
df

            0         1         2         3       new
A    0.386030  2.084019 -0.376519  0.230336  0.009512
B    0.681209  1.035125 -0.031160  1.939932  0.650049
C   -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D   -1.382920  1.482495  0.961458 -2.141212 -0.421462
E    0.992573  1.192241 -1.046780  1.292765 -0.054206
new  1.000000  2.000000  3.000000  4.000000  4.000000

In [9]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df['W'][0]

2.706849839399938

In [15]:
df['W'][0:2]

A    2.706850
B    0.651118
Name: W, dtype: float64

In [17]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
df['min']=[1,2,3,4,5]
df

          W         X         Y         Z  min
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [19]:
df.min

<bound method NDFrame._add_numeric_operations.<locals>.min of           W         X         Y         Z  min
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5>

In [20]:
df.insert(2,'new',[1,2,3,4,5])
df

          W         X  new         Y         Z  min
A  2.706850  0.628133    1  0.907969  0.503826    1
B  0.651118 -0.319318    2 -0.848077  0.605965    2
C -2.018168  0.740122    3  0.528813 -0.589001    3
D  0.188695 -0.758872    4 -0.933237  0.955057    4
E  0.190794  1.978757    5  2.605967  0.683509    5

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z  min
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [22]:
df

          W         X  new         Y         Z  min
A  2.706850  0.628133    1  0.907969  0.503826    1
B  0.651118 -0.319318    2 -0.848077  0.605965    2
C -2.018168  0.740122    3  0.528813 -0.589001    3
D  0.188695 -0.758872    4 -0.933237  0.955057    4
E  0.190794  1.978757    5  2.605967  0.683509    5

In [23]:
df.drop('E',axis=0)

          W         X  new         Y         Z  min
A  2.706850  0.628133    1  0.907969  0.503826    1
B  0.651118 -0.319318    2 -0.848077  0.605965    2
C -2.018168  0.740122    3  0.528813 -0.589001    3
D  0.188695 -0.758872    4 -0.933237  0.955057    4

In [24]:
df

          W         X  new         Y         Z  min
A  2.706850  0.628133    1  0.907969  0.503826    1
B  0.651118 -0.319318    2 -0.848077  0.605965    2
C -2.018168  0.740122    3  0.528813 -0.589001    3
D  0.188695 -0.758872    4 -0.933237  0.955057    4
E  0.190794  1.978757    5  2.605967  0.683509    5

In [25]:
df.reset_index()

  index         W         X  new         Y         Z  min
0     A  2.706850  0.628133    1  0.907969  0.503826    1
1     B  0.651118 -0.319318    2 -0.848077  0.605965    2
2     C -2.018168  0.740122    3  0.528813 -0.589001    3
3     D  0.188695 -0.758872    4 -0.933237  0.955057    4
4     E  0.190794  1.978757    5  2.605967  0.683509    5

In [29]:
newind = 'JKT BGR DPK TGR BKS'.split()
newind

['JKT', 'BGR', 'DPK', 'TGR', 'BKS']

In [30]:
df['Kota'] = newind
df

          W         X  new         Y         Z  min Kota
A  2.706850  0.628133    1  0.907969  0.503826    1  JKT
B  0.651118 -0.319318    2 -0.848077  0.605965    2  BGR
C -2.018168  0.740122    3  0.528813 -0.589001    3  DPK
D  0.188695 -0.758872    4 -0.933237  0.955057    4  TGR
E  0.190794  1.978757    5  2.605967  0.683509    5  BKS

In [31]:
df.set_index('Kota')

             W         X  new         Y         Z  min
Kota
JKT   2.706850  0.628133    1  0.907969  0.503826    1
BGR   0.651118 -0.319318    2 -0.848077  0.605965    2
DPK  -2.018168  0.740122    3  0.528813 -0.589001    3
TGR   0.188695 -0.758872    4 -0.933237  0.955057    4
BKS   0.190794  1.978757    5  2.605967  0.683509    5

In [32]:
df.drop('new',axis=1,inplace=True)

In [33]:
df

          W         X         Y         Z  min Kota
A  2.706850  0.628133  0.907969  0.503826    1  JKT
B  0.651118 -0.319318 -0.848077  0.605965    2  BGR
C -2.018168  0.740122  0.528813 -0.589001    3  DPK
D  0.188695 -0.758872 -0.933237  0.955057    4  TGR
E  0.190794  1.978757  2.605967  0.683509    5  BKS

In [34]:
df.set_index('Kota',inplace=True)

In [35]:
df

             W         X         Y         Z  min
Kota
JKT   2.706850  0.628133  0.907969  0.503826    1
BGR   0.651118 -0.319318 -0.848077  0.605965    2
DPK  -2.018168  0.740122  0.528813 -0.589001    3
TGR   0.188695 -0.758872 -0.933237  0.955057    4
BKS   0.190794  1.978757  2.605967  0.683509    5

In [36]:
df.drop('min',axis=1,inplace=True)

In [38]:
df

             W         X         Y         Z
Kota
JKT   2.706850  0.628133  0.907969  0.503826
BGR   0.651118 -0.319318 -0.848077  0.605965
DPK  -2.018168  0.740122  0.528813 -0.589001
TGR   0.188695 -0.758872 -0.933237  0.955057
BKS   0.190794  1.978757  2.605967  0.683509